'use strict';

Object.defineProperty(exports, "__esModule", {
    value: true
});
var app = getApp();
var bgm = wx.getBackgroundAudioManager();
var lyric_pos = 0;
var lyric_pots = [18, 25, 32, 40, 49, 56, 64, 71, 79, 84, 88, 94, 99, 102, 110, 112, 116, 119, 122, 125, 132, 139, 146, 153, 158, 161, 168, 172, 176, 183, 187, 191, 198, 202, 205, 215, 220, 224, 228, 232, 237, 240, 243, 250, 257, 264, 273, 277, 284, 1000];
var lyrics = ['如果春天你拆开了迟年的信件', '如果夏天你留意蝉雀的迷恋', '如果秋天你拥抱了纷飞的落叶', '那么冬天你能不能陪我看雪', '如果四季变迁你不在我身边', '如果西山的日头永远不变', '如果我难得见你嘴角的弯月', '那么你能不能别和我再见', '等等如约的你珊珊来信', '月昏到晨醒', '寸草潦算几季冷清', '凄美斑驳的雨 旷绝风景', '可四散流离', '只想和你躺下数星星',
//间奏
'', '有一天晚上梦到你了', '梦里是你高中时候的样子', '没有刘海带着眼镜', '',
//彩蛋
'如果美梦里记得我曾共你欢喜', '如果我愿意深海一直游到底', '如果今天起我决定要把你忘记', '可明天还是会忍不住想你', '等等如约的你珊珊来信', '月昏到晨清', '寸草潦算几季冷清', '凄美斑驳的雨旷绝风景', '可四散流离', '只想和你躺下数星星', '也许迟来的你 裙袂生熠', '带笑着抱歉', '摘朵小花映入我眼', '别等等你的我 走走停停', '世故染了心', '才想把我拥进怀里',
//间奏
'', '梦里我们在打乒乓球', '不小心球打到了你的脸上', '然后你哭了', '', '我也醒了', '', '若再从远方来赴这一面之约', '别又像从前匆匆的离别', '多想和你坐下聊聊早先那几年', '再讲讲那些心动的瞬间', '你短发与不带眼镜的样子', '真的很好看', ''];
var lyric_colors = ['#4285F4', '#EA4335', '#FBBC05'];
exports.default = Page({
    data: {
        p1: '以后我绝对不会忘记你生日了hhh\n其实你一说我就想起来了真的我发四\n其实你不说我也能想起来的嘻嘻嘻\n下图为证(上次给你过生日)',
        p2: '现在背景音乐应该加载出来了\n你看我准备的可还是超高音质的呢\n',
        p3: '上次见到你都是2019年2月10日那天了\n还是挺怀念高中的\n我还有你高一的时候有刘海的照片呢',
        p4: '自从上大学后\n真的就见得越来越少了\n也只有放假的时候\n如果我在成都的话还好说hhhh\n早知道把川大放前面了哈哈哈\n再加上你也不怎么发动态或者朋友圈\n不会是把我屏蔽了吧!!!\nhhhhh开个玩笑\n要是暑假我能回来的话\n记得请我吃饭嘻嘻嘻',
        p5: '想想我高中的时候\n还扯过你发带\n藏过你本子\n哈哈哈想起来感觉我好幼稚啊\n下次\n出来耍的时候记得系头发\n嗯我再幼稚一回\n突然想起来咱们和纯纯\n还有郭二蛋还有一个群呢\n寒假的时候在家找到了以前写题的本子\n翻了好久好久\n现在回想起来\n当时还挺耽误你时间的\n说不定本来能更好的\n献上我真诚的歉意\n许你一个愿望吧\n有效期10年哈',
        p6: '这张照片还是有一次\n从你手机里找到的哈哈\n再放最后一张，我发四hhhhh',
        p7: '还有上次!\n你自己把小时候照片发空间里\n哈哈哈哈还是我给你说的\n我就不放这里了哈嘻嘻嘻\n不过你小时候嘟嘴的样子\n真的好可爱啊\n(全医学院最可爱)',
        p8: '现在才知道时间过得这么快\n都已经快过去又一个高中三年了\n前天你说我没怎么变\n嗯我觉得我没变\n希望小杨同学能顺利考进川大!\n接下来的半年多\n一起努力趴\n',
        p9: '真的很幸运能遇到你\n因为你\n去尝试听了好多陈粒杨千嬅的歌\n还喜欢上了周柏豪的歌\n也认真去学物理想给你讲\n跟你闹\n赖着让你发照片\n我见过丢书包的你\n见过把你发带藏起来后着急的你\n见过和纯纯她们打闹的你\n也见过积极认真的你\n见过唱<走马>的你\n以及梦里的你\n(藏在歌词里了)\n真的很开心\n能在我百分之六十的回忆里有你',
        lyric: '',
        lyric_color: ''

    },
    onLoad: function onLoad() {
        bgm.title = '如约';
        bgm.epname = '如约';
        bgm.singer = '栗先达';
        bgm.src = 'https://www.hcyzyl.top/bgm.mp3';
        var that = this;
        bgm.onTimeUpdate(function () {
            console.log(bgm.currentTime);
            if (bgm.currentTime >= lyric_pots[lyric_pos]) {
                that.setData({
                    lyric: lyrics[lyric_pos],
                    lyric_color: lyric_colors[lyric_pos % lyric_colors.length]
                });
                lyric_pos += 1;
            }
        });
    },
    onShow: function onShow() {
        wx.request({
            url: app.globalData.server + '/yzrS',
            data: {},
            header: {
                'content-type': 'application/json'
            },
            method: 'GET',
            dataType: 'json'
        });
    },
    onUnload: function onUnload() {
        console.log('end');
        wx.request({
            url: app.globalData.server + '/yzrE',
            data: {},
            header: {
                'content-type': 'application/json'
            },
            method: 'GET',
            dataType: 'json'
        });
    }
});